content/recipe/slow-cooker-beef-stew.md
---
title: "Slow Cooker Beef Stew"
author: ["Trev"]
lastmod: 2022-05-30T11:03:40-07:00
categories: ["stew"]
draft: false
servings: 6
prep-time: 20
cook-time: 240
ready-in: 260
source-url: "https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/"
---

## Ingredients {#ingredients}

-   2 pounds beef stew meat, cut into 1-inch pieces
-   1/4 cup all-purpose flour
-   1/2 teaspoon salt
-   1/2 teaspoon ground black pepper
-   1  1/2 cups beef broth
-   4 medium carrots, sliced
-   3 medium potatoes, diced
-   1 medium onion, chopped
-   1 stalk celery, chopped
-   1 teaspoon Worcestershire sauce
-   1 teaspoon ground paprika
-   1 clove garlic, minced
-   1 large bay leaf


## Directions {#directions}

1.  Place meat in slow cooker.
2.  Mix flour, salt, and pepper together in a small bowl. Pour over meat, and stir until meat is coated.
3.  Add beef broth, carrots, potatoes, onion, celery, Worcestershire sauce, paprika, garlic, and bay leave; stir to combine.
4.  Cover, and cook until beef is tender enough to cut with a spoon, on Low for 8 to 12 hours, or on High for 4 to 6 hours.